In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame({
    "nome":["teo", "lara", "nah", "bia", "mah", "lara", "mah", "mah"],
    "sobrenome":["calvo", "calvo", "ataide", "ataide", "silva", "silva", "silva", "silva"],
    "salario": [2132, 1231, 454, 6543, 6532, 4322, 987, 2134]
})
df

   nome sobrenome  salario
0   teo     calvo     2132
1  lara     calvo     1231
2   nah    ataide      454
3   bia    ataide     6543
4   mah     silva     6532
5  lara     silva     4322
6   mah     silva      987
7   mah     silva     2134

In [66]:
novo_df = (df.sort_values("salario", ascending=False)
        .drop_duplicates(keep="last", subset=["nome", "sobrenome"]))

In [67]:
novo_df

   nome sobrenome  salario
3   bia    ataide     6543
5  lara     silva     4322
0   teo     calvo     2132
1  lara     calvo     1231
6   mah     silva      987
2   nah    ataide      454